//repo start(创建并切换分支)
$ repo start  <newbranchname> [--all | <project>…]
/********************************************************************************************************************************************************************
****刚克隆下来的代码是没有分支的,repo start实际是对git checkout –b 命令的封装。为指定的项目或所有项目.
****（若使用—all参数），以清单文件中为设定的分支，创建特性分支。
****这条指令与git checkout –b 还是有很大的区别的，git checkout –b 是在当前所在的分支的基础上创建特性分支，而repo start是在清单文件设定分支的基础上创建特性分支。
**********************************************************************************************************************************************************************/

//下载repo并克隆manifest
$ repo init –u URL [OPTIONS]
/********************************************************************************************************************************************************************
***** 例子：

         $ repo init -u https://github.com/OP-TEE/manifest.git -m default.xml --repo-url=git://codeaurora.org/tools/repo.git

***** Options:

         -u:指定一个URL，其连接到一个maniest仓库

         -m:在manifest仓库中选择一个xml文件

         -b:选择一个maniest仓库中的一个特殊的分支

命令repo init 要完成如下操作：

         完成repo工具的完整下载，执行的repo脚本只是引导程序

         克隆清单库manifest.git (地址来自于-u 参数)

         克隆的清单库位于manifest.git中，克隆到本地.repo/manifests.清单.repo/manifest.xml只是符号链接，它指向.repo/manifests/default.xml

         如果manifests中有多个xml文件，repo init 可以任意选择其中一个，默认选择是default.xml
**********************************************************************************************************************************************************************/

//下载代码
$ repo sync [<project>…]
/********************************************************************************************************************************************************************
**** 用于参照清单文件.repo/manifest.xml克隆并同步版本库。如果某个项目版本库尚不存在，则执行repo sync 命令相当于执行git clone，如果项目版本库已经存在，则相当于执行下面的两条指令：

         $ git remote update

**** 相当于对每一个remote源执行了fetch操作

         $ git rebase origin/branch

**** 针对当前分支的跟踪分支执行rebase操作。

**** Example:

		 $ repo sync

**** 也可以选择克隆其中的一个项目:

		 $ repo sync platform/build
**********************************************************************************************************************************************************************/




















//参考代码 https://blog.csdn.net/sunweizhong1024/article/details/8987494
